CsBoBoNice/STM32F4XX_CsBoBo_Lib/CsBoBo_STM32F4XX_usart.c
#include "CsBoBo_STM32F4XX_usart.h"
#include "CsBoBo_STM32F4XX_LIB.h"


/*

@例:	
		USART_init(	USART2,
					GPIOD,GPIO_Pin_5,	
					GPIOD,GPIO_Pin_6,
					9600,					//波特率
					USART_WordLength_8b,	//8位字长 字长(数据位+校验位)
					USART_StopBits_1,		//停止位 1	位
					USART_Parity_No,		//不使用校验
					USART_Mode_Rx | USART_Mode_Tx,	//接收和发送模式
					USART_HardwareFlowControl_None,	//硬件流控制失能
					0,0
					);

	参数1：USART编号
						USART1
						USART2
						USART3
						UART4
						UART5
						USART6
						UART7
						UART8
	参数2：TX GPIO 

	参数3：TX GPIO_Pin

	参数4：RX GPIO 

	参数5：RX GPIO_Pin 

			串口引脚:	(同一个串口引脚可随意搭配，例如: TX(PA9) RX(PB7) )
			串口		TX		RX
			USART1		PA9		PA10
						PB6		PB7

			USART2		PA2		PA3
						PD5		PD6 

			USART3		PB10	PB11
						PC10	PC11
						PD8		PD9
						
			UART4		PC10	PC11
						PA0		PA1
										
			UART5		PC12	PD2

			USART6		PG14	PG9
						PC6		PC7
						
			UART7		PF7		PF6
						PE8		PE7

			UART8		PE1		PE0
			
			
	参数6：波特率取值范围(600,1200,2400,4800,9600,14400,19200,28800,38400,57600,115200,230400,460800)
	
	参数7：字长(数据位+校验位)
			USART_WordLength_8b		8位字长
			USART_WordLength_9b		9位字长

	参数8：停止位
			USART_StopBits_1		停止位 1	位
			USART_StopBits_0_5		停止位 0.5	位
			USART_StopBits_2		停止位 2	位
			USART_StopBits_1_5		停止位 1.5	位

	参数9：校验位选择
			USART_Parity_No			不使用校验
			USART_Parity_Even		偶校验
			USART_Parity_Odd		奇校验

	参数10：USART模式控制：
			USART_Mode_Tx		发送模式
			USART_Mode_Rx		接收模式
			USART_Mode_Rx | USART_Mode_Tx	接收和发送模式
	
	参数11：硬件流控制：
			USART_HardwareFlowControl_None		硬件流控制失能
			USART_HardwareFlowControl_RTS		发送请求RTS使能
			USART_HardwareFlowControl_CTS		清除发送CTS使能
			USART_HardwareFlowControl_RTS_CTS	RTS和CTS使能

	参数12：对应抢断优先级级别	数值越低优先级越高

	参数13：对应响应优先级级别	数值越低优先级越高
*/
/******************************************************************************************************************/
/************************************************************************
@注:

	接收串口数据通过中断接收，通过定时器判断是否超时，
在CsBoBo_STM32F10X_usart.h里设置超时时间，与接收缓存区大小,如果未用到的串口可以注释，节约内存，

以下为定时器添加超时算法的代码:

#if defined (USING_USART1) || defined (USING_USART2) || defined (USING_USART3)|| defined (USING_UART4)|| defined (USING_UART5)
USART_ReceiveOvertimeProcess();
#endif


以下是使用带超时的串口接收代码

NVIC_Configuration(NVIC_PriorityGroup_4);//设置优先级分组：抢断优先级和相应优先级
TIM_Common_Init(2,7200,10,TIM_CounterMode_Up,3,0);	//定时器初始化 1MS
USART_init(1,115200,0,3,0);	//串口初始化

if(Get_USART_ready_buf_ok(USART1))	//判断超时，一帧数据接收成功
{
	Clean_USART_ready_buf_OK(USART1);//清除串口是否接收完毕标志
	
	USART_SendChars(USART1,USART1_ready_buf,USART1_ready_buf_len);	//回发
	
	Clean_USART_ready_buf(USART1);//清除串口缓存数据
}

USART1_ready_buf 接收到的数据
USART1_ready_buf_len 接收数据长度
*/
#ifdef USING_USART1
uint8_t USART1_receive_buf[USART1_BUF_SIZE];	//数据接收缓存区
uint8_t USART1_ready_buf[USART1_BUF_SIZE];		//接收成功后的数据区
static int32_t USART1_ReceiveTimeCounter = 0;	//超时剩余时间
__IO uint16_t USART1_receive_index=0; 		//正在接收的数据长度
__IO uint8_t USART1_ready_buf_ok = 0;		//是否成功接收
__IO uint16_t USART1_ready_buf_len = 0;		//成功接收后的数据长度
#endif

#ifdef USING_USART2
uint8_t USART2_receive_buf[USART2_BUF_SIZE],USART2_ready_buf[USART2_BUF_SIZE];
static int32_t USART2_ReceiveTimeCounter = 0;
__IO uint16_t USART2_receive_index=0; 
__IO uint8_t USART2_ready_buf_ok = 0;
__IO uint16_t USART2_ready_buf_len=0;
#endif

#ifdef USING_USART3
static int32_t USART3_ReceiveTimeCounter = 0;
uint8_t USART3_receive_buf[USART3_BUF_SIZE],USART3_ready_buf[USART3_BUF_SIZE];
__IO uint16_t USART3_receive_index=0; 
__IO uint8_t USART3_ready_buf_ok = 0;
__IO uint16_t USART3_ready_buf_len=0;
#endif

#ifdef USING_UART4
uint8_t UART4_receive_buf[UART4_BUF_SIZE],UART4_ready_buf[UART4_BUF_SIZE];
static int32_t UART4_ReceiveTimeCounter = 0;
__IO uint16_t UART4_receive_index=0; 
__IO uint8_t UART4_ready_buf_ok = 0;
__IO uint16_t UART4_ready_buf_len=0;
#endif

#ifdef USING_UART5
uint8_t UART5_receive_buf[UART5_BUF_SIZE],UART5_ready_buf[UART5_BUF_SIZE];
static int32_t UART5_ReceiveTimeCounter = 0;
__IO uint16_t UART5_receive_index=0; 
__IO uint8_t UART5_ready_buf_ok = 0;
__IO uint16_t UART5_ready_buf_len=0;
#endif

#ifdef USING_USART6
uint8_t USART6_receive_buf[USART6_BUF_SIZE];	//数据接收缓存区
uint8_t USART6_ready_buf[USART6_BUF_SIZE];		//接收成功后的数据区
static int32_t USART6_ReceiveTimeCounter = 0;	//超时剩余时间
__IO uint16_t USART6_receive_index=0; 		//正在接收的数据长度
__IO uint8_t USART6_ready_buf_ok = 0;		//是否成功接收
__IO uint16_t USART6_ready_buf_len = 0;		//成功接收后的数据长度
#endif

#ifdef USING_UART7
uint8_t UART7_receive_buf[UART7_BUF_SIZE],UART7_ready_buf[UART7_BUF_SIZE];
static int32_t UART7_ReceiveTimeCounter = 0;
__IO uint16_t UART7_receive_index=0; 
__IO uint8_t UART7_ready_buf_ok = 0;
__IO uint16_t UART7_ready_buf_len=0;
#endif

#ifdef USING_UART8
uint8_t UART8_receive_buf[UART8_BUF_SIZE],UART8_ready_buf[UART8_BUF_SIZE];
static int32_t UART8_ReceiveTimeCounter = 0;
__IO uint16_t UART8_receive_index=0; 
__IO uint8_t UART8_ready_buf_ok = 0;
__IO uint16_t UART8_ready_buf_len=0;
#endif

void USART1_ISR(void); //串口中断函数
void USART2_ISR(void); //串口中断函数
void USART3_ISR(void); //串口中断函数
void UART4_ISR(void); //串口中断函数
void UART5_ISR(void); //串口中断函数
void USART6_ISR(void); //串口中断函数
void UART7_ISR(void); //串口中断函数
void UART8_ISR(void); //串口中断函数

/**********************中断函数***************************************************************************************************/
#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F401xx) || defined(STM32F411xE) || defined(STM32F446xx) 
void USART1_IRQHandler(void)
{
	#ifdef USING_USART1
	USART1_ISR();
	#endif
}	

void USART2_IRQHandler(void)
{
	#ifdef USING_USART2
	USART2_ISR();
	#endif
}
#endif

#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F446xx) 	
void USART3_IRQHandler(void)
{
	#ifdef USING_USART3
	USART3_ISR();
	#endif
}
#endif

#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F446xx) 	
void UART4_IRQHandler(void)
{
	#ifdef USING_UART4
	UART4_ISR();
	#endif
}

void UART5_IRQHandler(void)
{
	#ifdef USING_UART5
	UART5_ISR();
	#endif
}
#endif

#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F401xx) || defined(STM32F411xE) || defined(STM32F446xx) 	
void USART6_IRQHandler(void)
{
	#ifdef USING_USART6
	USART6_ISR();
	#endif
}
#endif

