CsBoBoNice/STM32F4XX_CsBoBo_Lib/CsBoBo_STM32F4XX_usart.c
#if defined(STM32F427_437xx) || defined(STM32F429_439xx)	
void UART7_IRQHandler(void)
{
	#ifdef USING_UART7
	UART7_ISR();
	#endif
}
void UART8_IRQHandler(void)
{
	#ifdef USING_UART8
	UART8_ISR();
	#endif
}
#endif

/**********************串口1中断接收一个字符***************************************************************************************************/
/*
在中断服务程序中，由于主机响应中断时并不知道是哪个中断源发出中断请求，
因此必须在中断服务程序中对中断源进行判别，然后分别进行处理。
当然，如果只涉及到一个中断请求，是不用做上述判别的。但是无论什么情况，做上述判别是个好习惯
*/
#ifdef USING_USART1
void USART1_ISR(void)   
{

	if (USART_GetITStatus(USART1, USART_IT_RXNE) != RESET)//判断是否是中断
	{
		USART1_ReceiveTimeCounter = USART1_RECEIVE_OVERTIME;

		if(USART1_receive_index >= USART1_BUF_SIZE)//若接收位置越界，那么重头开始存放
			USART1_receive_index = 0;
		
		USART1_receive_buf[USART1_receive_index++] = (uint8_t)USART_ReceiveData(USART1);//接收字符，并位置加1		
	}	
	if (USART_GetFlagStatus(USART1, USART_FLAG_ORE) != RESET)//过载处理，只要读状态寄存器和数据寄存器就可自动清理此标志
	{
		(void)USART_ReceiveData(USART1);
	}

} 
#endif

#ifdef USING_USART2
void USART2_ISR(void)
{
	if (USART_GetITStatus(USART2, USART_IT_RXNE) != RESET)  //判断是否是中断
	{	
		USART2_ReceiveTimeCounter = USART2_RECEIVE_OVERTIME;
		
		if(USART2_receive_index >= USART2_BUF_SIZE)	//若接收位置越界，那么重头开始存放
			USART2_receive_index = 0;
		
		USART2_receive_buf[USART2_receive_index++] = (uint8_t)USART_ReceiveData(USART2);//接收字符，并位置加1
		
	}		
	if (USART_GetFlagStatus(USART2, USART_FLAG_ORE) != RESET)//过载处理，只要读状态寄存器和数据寄存器就可自动清理此标志
	{
		(void)USART_ReceiveData(USART2);
	}
}
#endif

#ifdef USING_USART3
void USART3_ISR(void)
{
	if (USART_GetITStatus(USART3, USART_IT_RXNE) != RESET)
	{
		USART3_ReceiveTimeCounter = USART3_RECEIVE_OVERTIME;
		if(USART3_receive_index >= USART3_BUF_SIZE)
			USART3_receive_index = 0;
		
		USART3_receive_buf[USART3_receive_index++] = (uint8_t)USART_ReceiveData(USART3);
		
	}
		
	if (USART_GetFlagStatus(USART3, USART_FLAG_ORE) != RESET)
	{
		(void)USART_ReceiveData(USART3);
	}
}
#endif

#ifdef USING_UART4
void UART4_ISR(void)
{
	if (USART_GetITStatus(UART4, USART_IT_RXNE) != RESET)
	{
		UART4_ReceiveTimeCounter = UART4_RECEIVE_OVERTIME;
		if(UART4_receive_index >= UART4_BUF_SIZE)
			UART4_receive_index = 0;
		
		UART4_receive_buf[UART4_receive_index++] = (uint8_t)USART_ReceiveData(UART4);
		
	}
		
	if (USART_GetFlagStatus(UART4, USART_FLAG_ORE) != RESET)
	{
		(void)USART_ReceiveData(UART4);
	}
}
#endif

#ifdef USING_UART5
void UART5_ISR(void)
{
	if (USART_GetITStatus(UART5, USART_IT_RXNE) != RESET)
	{		
		UART5_ReceiveTimeCounter = UART5_RECEIVE_OVERTIME;
		if(UART5_receive_index >= UART5_BUF_SIZE)
			UART5_receive_index = 0;
		
		UART5_receive_buf[UART5_receive_index++] = (uint8_t)USART_ReceiveData(UART5);
		
	}
		
	if (USART_GetFlagStatus(UART5, USART_FLAG_ORE) != RESET)
	{
		(void)USART_ReceiveData(UART5);
	}
}
#endif

#ifdef USING_USART6
void USART6_ISR(void)
{
	if (USART_GetITStatus(USART6, USART_IT_RXNE) != RESET)
	{
		USART6_ReceiveTimeCounter = USART6_RECEIVE_OVERTIME;
		if(USART6_receive_index >= USART6_BUF_SIZE)
			USART6_receive_index = 0;
		
		USART6_receive_buf[USART6_receive_index++] = (uint8_t)USART_ReceiveData(USART6);
		
	}
		
	if (USART_GetFlagStatus(USART6, USART_FLAG_ORE) != RESET)
	{
		(void)USART_ReceiveData(USART6);
	}
}
#endif

#ifdef USING_UART7
void UART7_ISR(void)
{
	if (USART_GetITStatus(UART7, USART_IT_RXNE) != RESET)
	{		
		UART7_ReceiveTimeCounter = UART7_RECEIVE_OVERTIME;
		if(UART7_receive_index >= UART7_BUF_SIZE)
			UART7_receive_index = 0;
		
		UART7_receive_buf[UART7_receive_index++] = (uint8_t)USART_ReceiveData(UART7);
		
	}
		
	if (USART_GetFlagStatus(UART7, USART_FLAG_ORE) != RESET)
	{
		(void)USART_ReceiveData(UART7);
	}
}
#endif

#ifdef USING_UART8
void UART8_ISR(void)
{
	if (USART_GetITStatus(UART8, USART_IT_RXNE) != RESET)
	{		
		UART8_ReceiveTimeCounter = UART8_RECEIVE_OVERTIME;
		if(UART8_receive_index >= UART8_BUF_SIZE)
			UART8_receive_index = 0;
		
		UART8_receive_buf[UART8_receive_index++] = (uint8_t)USART_ReceiveData(UART8);
		
	}
		
	if (USART_GetFlagStatus(UART8, USART_FLAG_ORE) != RESET)
	{
		(void)USART_ReceiveData(UART8);
	}
}

#endif

//在中断中执行的代码
void USART_ReceiveOvertimeProcess(void)		//在中断中执行的代码
{
	#if defined (USING_USART1) || defined (USING_USART2) || defined (USING_USART3)|| defined (USING_UART4)|| defined (USING_UART5)
	uint16_t i = 0;	
	#endif
	
	#ifdef USING_USART1
	if(USART1_ReceiveTimeCounter>=USART_PERIOD_MS)
	{
		USART1_ReceiveTimeCounter -= USART_PERIOD_MS;

		if(USART1_ReceiveTimeCounter<USART_PERIOD_MS)
		{
			USART1_ready_buf_len = USART1_receive_index;

			for(i = 0;i <= USART1_ready_buf_len; i ++)
				USART1_ready_buf[i] = USART1_receive_buf[i];
	
			USART1_ready_buf_ok = UART_OK;
			USART1_receive_index=0;
			USART1_ReceiveTimeCounter = 0;
		}
	}
	#endif

	#ifdef USING_USART2
	if(USART2_ReceiveTimeCounter>=USART_PERIOD_MS)
	{
		USART2_ReceiveTimeCounter -= USART_PERIOD_MS;

		if(USART2_ReceiveTimeCounter<USART_PERIOD_MS)
		{
			USART2_ready_buf_len = USART2_receive_index;

			for(i = 0;i <= USART2_ready_buf_len; i ++)
				USART2_ready_buf[i] = USART2_receive_buf[i];
	
			USART2_ready_buf_ok = UART_OK;
			USART2_receive_index=0;
			USART2_ReceiveTimeCounter = 0;
		}
	}
	#endif

	#ifdef USING_USART3
	if(USART3_ReceiveTimeCounter>=USART_PERIOD_MS)
	{
		USART3_ReceiveTimeCounter -= USART_PERIOD_MS;

		if(USART3_ReceiveTimeCounter<USART_PERIOD_MS)
		{
			USART3_ready_buf_len = USART3_receive_index;

			for(i = 0;i <= USART3_ready_buf_len; i ++)
				USART3_ready_buf[i] = USART3_receive_buf[i];
	
			USART3_ready_buf_ok = UART_OK;
			USART3_receive_index=0;
			USART3_ReceiveTimeCounter = 0;
		}
	}
	#endif

	#ifdef USING_UART4
	if(UART4_ReceiveTimeCounter>=USART_PERIOD_MS)
	{
		UART4_ReceiveTimeCounter -= USART_PERIOD_MS;

		if(UART4_ReceiveTimeCounter<USART_PERIOD_MS)
		{
			UART4_ready_buf_len = UART4_receive_index;

			for(i = 0;i <= UART4_ready_buf_len; i ++)
				UART4_ready_buf[i] = UART4_receive_buf[i];
	
			UART4_ready_buf_ok = UART_OK;
			UART4_receive_index=0;
			UART4_ReceiveTimeCounter = 0;
		}
	}
	#endif

	#ifdef USING_UART5
	if(UART5_ReceiveTimeCounter>=USART_PERIOD_MS)
	{
		UART5_ReceiveTimeCounter -= USART_PERIOD_MS;

		if(UART5_ReceiveTimeCounter<USART_PERIOD_MS)
		{
			UART5_ready_buf_len = UART5_receive_index;

			for(i = 0;i <= UART5_ready_buf_len; i ++)
				UART5_ready_buf[i] = UART5_receive_buf[i];
	
			UART5_ready_buf_ok = UART_OK;
			UART5_receive_index=0;
			UART5_ReceiveTimeCounter = 0;
		}
	}
	#endif
	
	#ifdef USING_USART6
	if(USART6_ReceiveTimeCounter>=USART_PERIOD_MS)
	{
		USART6_ReceiveTimeCounter -= USART_PERIOD_MS;

		if(USART6_ReceiveTimeCounter<USART_PERIOD_MS)
		{
			USART6_ready_buf_len = USART6_receive_index;

			for(i = 0;i <= USART6_ready_buf_len; i ++)
				USART6_ready_buf[i] = USART6_receive_buf[i];
	
