CsBoBoNice/STM32F4XX_CsBoBo_Lib/CsBoBo_STM32F4XX_usart.c
			USART6_ready_buf_ok = UART_OK;
			USART6_receive_index=0;
			USART6_ReceiveTimeCounter = 0;
		}
	}
	#endif	
	
	#ifdef USING_UART7
	if(UART7_ReceiveTimeCounter>=USART_PERIOD_MS)
	{
		UART7_ReceiveTimeCounter -= USART_PERIOD_MS;

		if(UART7_ReceiveTimeCounter<USART_PERIOD_MS)
		{
			UART7_ready_buf_len = UART7_receive_index;

			for(i = 0;i <= UART7_ready_buf_len; i ++)
				UART7_ready_buf[i] = UART7_receive_buf[i];
	
			UART7_ready_buf_ok = UART_OK;
			UART7_receive_index=0;
			UART7_ReceiveTimeCounter = 0;
		}
	}
	#endif	
	
	#ifdef USING_UART8
	if(UART8_ReceiveTimeCounter>=USART_PERIOD_MS)
	{
		UART8_ReceiveTimeCounter -= USART_PERIOD_MS;

		if(UART8_ReceiveTimeCounter<USART_PERIOD_MS)
		{
			UART8_ready_buf_len = UART8_receive_index;

			for(i = 0;i <= UART8_ready_buf_len; i ++)
				UART8_ready_buf[i] = UART8_receive_buf[i];
	
			UART8_ready_buf_ok = UART_OK;
			UART8_receive_index=0;
			UART8_ReceiveTimeCounter = 0;
		}
	}
	#endif		
}

/******************************************************************************************************************/

//判断串口是否接收完毕
//接收成功返回 UART_OK
//接收失败返回 UART_ERROR
int Get_USART_ready_buf_ok(USART_TypeDef * usart)
{
#ifdef USING_USART1
	if(usart==USART1)return USART1_ready_buf_ok;
#endif	
	
#ifdef USING_USART2
	if(usart==USART2)return USART2_ready_buf_ok;
#endif

#ifdef USING_USART3
	if(usart==USART3)return USART3_ready_buf_ok;
#endif
	
#ifdef USING_UART4
	if(usart==UART4)return UART4_ready_buf_ok;
#endif	
	
#ifdef USING_UART5
	if(usart==UART5)return UART5_ready_buf_ok;
#endif	

#ifdef USING_USART6
	if(usart==USART6)return USART6_ready_buf_ok;
#endif	

#ifdef USING_UART7
	if(usart==UART7)return UART7_ready_buf_ok;
#endif

#ifdef USING_UART8
	if(usart==UART8)return UART8_ready_buf_ok;
#endif	
	return UART_ERROR;
}

//清除串口是否接收完毕标志
void Clean_USART_ready_buf_OK(USART_TypeDef * usart)
{
#ifdef USING_USART1
	if(usart==USART1)
	{
		USART1_ready_buf_ok=UART_ERROR;
	}
#endif	
	
#ifdef USING_USART2
	if(usart==USART2)
	{
		USART2_ready_buf_ok=UART_ERROR;
	}
#endif

#ifdef USING_USART3
	if(usart==USART3)
	{
		USART3_ready_buf_ok=UART_ERROR;
	}		
#endif
	
#ifdef USING_UART4
	if(usart==UART4)
	{
		UART4_ready_buf_ok=UART_ERROR;
	}		
#endif	
	
#ifdef USING_UART5
	if(usart==UART5)
	{
		UART5_ready_buf_ok=UART_ERROR;
	}
#endif

#ifdef USING_USART6
	if(usart==USART6)
	{
		USART6_ready_buf_ok=UART_ERROR;
	}		
#endif	

#ifdef USING_UART7
	if(usart==UART7)
	{
		UART7_ready_buf_ok=UART_ERROR;
	}
#endif	

#ifdef USING_UART8
	if(usart==UART8)
	{
		UART8_ready_buf_ok=UART_ERROR;
	}
#endif	
	
}

//清除串口缓存数据
void Clean_USART_ready_buf(USART_TypeDef * usart)
{
#ifdef USING_USART1
	if(usart==USART1)
	{
		memset(USART1_ready_buf,0,USART1_BUF_SIZE);
	}
#endif	
	
#ifdef USING_USART2
	if(usart==USART2)
	{
		memset(USART2_ready_buf,0,USART2_BUF_SIZE);
	}
#endif

#ifdef USING_USART3
	if(usart==USART3)
	{
		memset(USART3_ready_buf,0,USART3_BUF_SIZE);
	}		
#endif
	
#ifdef USING_UART4
	if(usart==UART4)
	{
		memset(UART4_ready_buf,0,UART4_BUF_SIZE);
	}		
#endif	
	
#ifdef USING_UART5
	if(usart==UART5)
	{
		memset(UART5_ready_buf,0,UART5_BUF_SIZE);
	}
#endif			

#ifdef USING_USART6
	if(usart==USART6)
	{
		memset(USART6_ready_buf,0,USART6_BUF_SIZE);
	}		
#endif	

#ifdef USING_UART7
	if(usart==UART7)
	{
		memset(UART7_ready_buf,0,UART7_BUF_SIZE);
	}
#endif

#ifdef USING_UART8
	if(usart==UART8)
	{
		memset(UART8_ready_buf,0,UART8_BUF_SIZE);
	}
#endif	
	
}

/******************************************************************************************************************/
static uint8_t GPIO_AF_X(USART_TypeDef * USARTx)
{
	#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F401xx) || defined(STM32F411xE) || defined(STM32F446xx) 
	if		(USARTx==USART1) {return GPIO_AF_USART1;}
	else if	(USARTx==USART2) {return GPIO_AF_USART2;}
	#endif
	
	#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F446xx) 	
	else if	(USARTx==USART3) {return GPIO_AF_USART3;}
	#endif
	
	#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F446xx) 	
	else if	(USARTx==UART4) {return GPIO_AF_UART4;}
	else if	(USARTx==UART5) {return GPIO_AF_UART5;}
	#endif
	
	#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F401xx) || defined(STM32F411xE) || defined(STM32F446xx) 	
	else if	(USARTx==USART6) {return GPIO_AF_USART6;}
	#endif
	
	#if defined(STM32F427_437xx) || defined(STM32F429_439xx)	
	else if	(USARTx==UART7) {return GPIO_AF_UART7;}
	else if	(USARTx==UART8) {return GPIO_AF_UART8;}
	#endif
	return 0;
}

static uint32_t Get_GPIO_PinSourceX(u16 GPIO_PIN)
{
	switch(GPIO_PIN)
	{
		case GPIO_Pin_0: return GPIO_PinSource0; 
		case GPIO_Pin_1: return GPIO_PinSource1;
		case GPIO_Pin_2: return GPIO_PinSource2; 
		case GPIO_Pin_3: return GPIO_PinSource3;
		case GPIO_Pin_4: return GPIO_PinSource4; 
		case GPIO_Pin_5: return GPIO_PinSource5;
		case GPIO_Pin_6: return GPIO_PinSource6; 
		case GPIO_Pin_7: return GPIO_PinSource7;
		case GPIO_Pin_8: return GPIO_PinSource8; 
		case GPIO_Pin_9: return GPIO_PinSource9;
		case GPIO_Pin_10: return GPIO_PinSource10; 
		case GPIO_Pin_11: return GPIO_PinSource11;
		case GPIO_Pin_12: return GPIO_PinSource12; 
		case GPIO_Pin_13: return GPIO_PinSource13;
		case GPIO_Pin_14: return GPIO_PinSource14; 
		case GPIO_Pin_15: return GPIO_PinSource15;
	}
	return 0;
}

static uint8_t Get_NVIC_IRQChannel_USART(USART_TypeDef * USARTx)
{
	#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F401xx) || defined(STM32F411xE) || defined(STM32F446xx) 
	if		(USARTx==USART1) {return USART1_IRQn;}
	else if	(USARTx==USART2) {return USART2_IRQn;}
	#endif
	
	#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F446xx) 	
	else if	(USARTx==USART3) {return USART3_IRQn;}
	#endif
	
	#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F446xx) 	
	else if	(USARTx==UART4) {return UART4_IRQn;}
	else if	(USARTx==UART5) {return UART5_IRQn;}
	#endif
	
	#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F401xx) || defined(STM32F411xE) || defined(STM32F446xx) 	
	else if	(USARTx==USART6) {return USART6_IRQn;}
	#endif
	
