CsBoBoNice/STM32F4XX_CsBoBo_Lib/CsBoBo_STM32F4XX_usart.c
	#if defined(STM32F427_437xx) || defined(STM32F429_439xx)	
	else if	(USARTx==UART7) {return UART7_IRQn;}
	else if	(USARTx==UART8) {return UART8_IRQn;}
	#endif
	return 0;
}

static void USART_RCC_PeriphClockCmd(USART_TypeDef * USARTx)
{
	#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F401xx) || defined(STM32F411xE) || defined(STM32F446xx) 
	if		(USARTx==USART1) {	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);}
	else if	(USARTx==USART2) {	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);}
	#endif
	
	#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F446xx) 	
	else if	(USARTx==USART3) {	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);}
	#endif
	
	#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F446xx) 	
	else if	(USARTx==UART4) {RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART4, ENABLE);}
	else if	(USARTx==UART5) {RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART5, ENABLE);}
	#endif
	
	#if defined(STM32F40_41xxx) || defined(STM32F427_437xx) || defined(STM32F429_439xx) || defined(STM32F401xx) || defined(STM32F411xE) || defined(STM32F446xx) 	
	else if	(USARTx==USART6) {RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART6, ENABLE);}
	#endif
	
	#if defined(STM32F427_437xx) || defined(STM32F429_439xx)	
	else if	(USARTx==UART7) {RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART7, ENABLE);}
	else if	(USARTx==UART8) {RCC_APB1PeriphClockCmd(RCC_APB1Periph_UART8, ENABLE);}
	#endif

}

//串口初始化函数
void USART_init	(	USART_TypeDef * USARTx,			
					GPIO_TypeDef* USART_TX_GPIOx,	
					u16 USART_TX_PIN,
					GPIO_TypeDef* USART_RX_GPIOx,
					u16 USART_RX_PIN,
					uint32_t USART_BaudRate,			//波特率设置
					uint16_t USART_WordLength,			//字长(数据位+校验位)
					uint16_t USART_StopBits,			//停止位		
					uint16_t USART_Parity,				//校验位选择
					uint16_t USART_Mode,				//USART模式控制
					uint16_t USART_HardwareFlowControl,	//硬件流控制
					uint8_t PreemptionPriority,			//抢占优先级
					uint8_t SubPriority					//子优先级
				)
{

	USART_InitTypeDef USART_InitStructure;
	uint8_t NVIC_IRQChannel_USART;
	uint16_t GPIO_PinSource_RX;
	uint16_t GPIO_PinSource_TX;
	uint8_t GPIO_AF;

	USART_RCC_PeriphClockCmd(USARTx);	/* 使能 USART 时钟 */
	
	GPIO_Common_Init(USART_TX_GPIOx,USART_TX_PIN,GPIO_Mode_AF,GPIO_OType_PP,GPIO_PuPd_UP,GPIO_Speed_100MHz);
	GPIO_Common_Init(USART_RX_GPIOx,USART_RX_PIN,GPIO_Mode_AF,GPIO_OType_PP,GPIO_PuPd_UP,GPIO_Speed_100MHz);
	
	GPIO_PinSource_TX=Get_GPIO_PinSourceX(USART_TX_PIN);
	GPIO_PinSource_RX=Get_GPIO_PinSourceX(USART_RX_PIN);
	GPIO_AF=GPIO_AF_X(USARTx);
	
	/* 连接 PXx 到 USARTx_Tx*/
	GPIO_PinAFConfig(USART_TX_GPIOx,GPIO_PinSource_TX,GPIO_AF);

	/*  连接 PXx 到 USARTx__Rx*/
	GPIO_PinAFConfig(USART_RX_GPIOx,GPIO_PinSource_RX,GPIO_AF);
	
	USART_InitStructure.USART_BaudRate = USART_BaudRate;/* 波特率设置：*/	
	USART_InitStructure.USART_WordLength = USART_WordLength;/* 字长(数据位+校验位)：8 USART_WordLength_8b*/
	USART_InitStructure.USART_StopBits = USART_StopBits;	/* 停止位：1个停止位 USART_StopBits_1*/
	USART_InitStructure.USART_Parity = USART_Parity;	/* 校验位选择：不使用校验 USART_Parity_No*/
	USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl	/* 硬件流控制：不使用硬件流 USART_HardwareFlowControl_None*/;
	USART_InitStructure.USART_Mode = USART_Mode;	/* USART模式控制：同时使能接收和发送 USART_Mode_Rx | USART_Mode_Tx*/
	USART_Init(USARTx, &USART_InitStructure); 	/* 完成USART初始化配置 */

	NVIC_IRQChannel_USART=Get_NVIC_IRQChannel_USART(USARTx);
	NVIC_Init_IRQChannel(NVIC_IRQChannel_USART,PreemptionPriority,SubPriority,ENABLE);//配置 NVIC	

	USART_ITConfig(USARTx, USART_IT_RXNE, ENABLE);	/* 使能串口接收中断 */

	USART_Cmd(USARTx, ENABLE);	/* 使能串口 */
}


/*****************  发送一个字符 **********************/
void Usart_SendByte( USART_TypeDef * pUSARTx, uint8_t ch)
{
	/* 发送一个字节数据到USART */
	USART_SendData(pUSARTx,ch);
		
	/* 等待发送数据寄存器为空 */
	while (USART_GetFlagStatus(pUSARTx, USART_FLAG_TXE) == RESET);	
}

/*****************  发送字符串 **********************/
void Usart_SendString( USART_TypeDef * pUSARTx, char *str)
{
	unsigned int k=0;
  do 
  {
      Usart_SendByte( pUSARTx, *(str + k) );
      k++;
  } while(*(str + k)!='\0');
  
  /* 等待发送完成 */
  while(USART_GetFlagStatus(pUSARTx,USART_FLAG_TC)==RESET)
  {}
}

//发送一串数据
void USART_SendChars(USART_TypeDef* USARTx,const uint8_t* SendChars,uint16_t len)	//发送一串数据
{
	uint16_t i = 0;
	for(i = 0; i < len; i++)
	{
    	USARTx->DR = (*(SendChars + i) & (uint16_t)0x01FF);
		while (USART_GetFlagStatus(USARTx, USART_FLAG_TC) == RESET);
	}
}

/*****************  发送一个16位数 **********************/
void Usart_SendHalfWord( USART_TypeDef * pUSARTx, uint16_t ch)
{
	uint8_t temp_h, temp_l;
	
	/* 取出高八位 */
	temp_h = (ch&0XFF00)>>8;
	/* 取出低八位 */
	temp_l = ch&0XFF;
	
	/* 发送高八位 */
	USART_SendData(pUSARTx,temp_h);	
	while (USART_GetFlagStatus(pUSARTx, USART_FLAG_TXE) == RESET);
	
	/* 发送低八位 */
	USART_SendData(pUSARTx,temp_l);	
	while (USART_GetFlagStatus(pUSARTx, USART_FLAG_TXE) == RESET);	
}



